{{- if and (eq .chezmoi.os "linux") (or (eq .chezmoi.osRelease.id "bazzite") (eq .chezmoi.osRelease.id "fedora")) }}
# Homebrew Bundle file for Bazzite/Fedora (CLI tools only, no casks)
# Install with: brew bundle --file=~/Brewfile

# CLI tools
brew "git"
brew "neovim"
brew "direnv"
brew "chezmoi"
brew "fish"
brew "htop"
brew "jq"
brew "ripgrep"
brew "fzf"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "lazygit"
brew "gh"
brew "starship"
brew "atuin"
brew "uv"
brew "tldr"
brew "tree"
brew "wget"
brew "curl"
brew "ffmpeg"

# Development tools
brew "mise"
brew "python@3.12"
brew "go"
{{- end }}
